[
    {
      "title": "The ins and outs of HTML5, CSS3, and Modern JavaScript for 2021"
    },
    {
      "title": "Create responsive, accessible, and beautiful layouts"
    },
    {
      "title": "Continue to learn and grow as a developer, long after the course ends"
    },
    {
      "title": "Create a complicated yelp-like application from scratch"
    },
    {
      "title": "Create static HTML and CSS portfolio sites and landing pages"
    },
    {
      "title": "Create complex HTML forms with validations"
    },
    {
      "title": "Use CSS Frameworks including Bootstrap 5, Semantic UI, and Bulma"
    },
    {
      "title": "Use JavaScript variables, conditionals, loops, functions, arrays, and objects"
    },
    {
      "title": "Master the \"weird\" parts of JavaScript"
    },
    {
      "title": "Manipulate the DOM with vanilla JS"
    },
    {
      "title": "Use Postman to monitor and test APIs"
    },
    {
      "title": "Write complex web apps with multiple models and data associations"
    },
    {
      "title": "Use Express and MongoDB to create full-stack JS applications"
    },
    {
      "title": "Master the command line interface"
    },
    {
      "title": "Understand the ins and outs of HTTP requests"
    },
    {
      "title": "Make a beautiful, responsive photographer's portfolio page"
    },
    {
      "title": "Implement user authentication"
    },
    {
      "title": "Make REAL web applications using cutting-edge technologies"
    },
    {
      "title": "Recognize and prevent common security exploits like SQL-Injection & XSS"
    },
    {
      "title": "Create a blog application from scratch using Node, Express, and MongoDB"
    },
    {
      "title": "Deploy your applications and work with cloud databases"
    },
    {
      "title": "Think like a developer. Become an expert at Googling code questions!"
    },
    {
      "title": "Implement full authentication from scratch!"
    },
    {
      "title": "Implement responsive navbars on websites"
    },
    {
      "title": "Write JavaScript functions, and understand scope and higher-order functions"
    },
    {
      "title": "Create full-stack web applications from scratch"
    },
    {
      "title": "Write JavaScript based browser games"
    },
    {
      "title": "Use NodeJS to write server-side JavaScript"
    },
    {
      "title": "Write a REAL application using everything in the course"
    },
    {
      "title": "Use common JS data structures like Arrays and Objects"
    },
    {
      "title": "Use NPM to install all sorts of useful packages"
    },
    {
      "title": "Create your own Node modules"
    },
    {
      "title": "Create a beautiful, responsive landing page for a startup"
    },
    {
      "title": "Create a beautiful animated todo list"
    }
  ]
  